let quote = document.getElementById('quote');
let btn = document.getElementById('btn');

let quotes = [
  " নিয়তের উপরই সকল আমলের ফল নির্ভর করে। (সহীহ বুখারী ও মুসলিম)",

  " তোমাদের মধ্যে সেই ব্যক্তি উত্তম, যে কুরআন শিক্ষা করে এবং অন্যকে শিক্ষা দেয়।",

  " মুসলমান সেই ব্যক্তি, যার জিহ্বা ও হাত থেকে অন্য মুসলমান নিরাপদ থাকে।",

  " যে আল্লাহ ও পরকালে বিশ্বাস করে, সে যেন ভালো কথা বলে অথবা নীরব থাকে।",

  " হাসিমুখে ভাইয়ের সঙ্গে সাক্ষাৎ করাও সদকা।",

  " পরিচ্ছন্নতা ঈমানের অর্ধেক।",

  " দান করলে সম্পদ কমে না।",

  " মায়ের পায়ের নিচে সন্তানের জান্নাত।",

  "যে মানুষের প্রতি দয়া করে না, আল্লাহও তার প্রতি দয়া করেন না।",

  " শক্তিশালী সেই ব্যক্তি নয়, যে কুস্তিতে জয়ী হয়; বরং সে-ই শক্তিশালী, যে রাগের সময় নিজেকে নিয়ন্ত্রণ করতে পারে।",

  " সত্যবাদিতা নেকির দিকে নিয়ে যায়, আর নেকি জান্নাতের দিকে নিয়ে যায়।",

  " মিথ্যা পাপের দিকে নিয়ে যায়, আর পাপ জাহান্নামের দিকে নিয়ে যায়।",

  " উত্তম চরিত্রই সর্বোত্তম সম্পদ।",

  " প্রতিবেশীর সঙ্গে উত্তম আচরণ করো।",

  " পিতা সন্তানের জন্য উত্তম চরিত্রের চেয়ে বড় উপহার দিতে পারে না।",

  " যে আল্লাহর জন্য বিনয়ী হয়, আল্লাহ তাকে মর্যাদা দান করেন।",

  " আল্লাহ সুন্দর, তিনি সৌন্দর্য পছন্দ করেন।",

  " যে ক্ষমা করে, আল্লাহ তার মর্যাদা বৃদ্ধি করেন।",

  " জ্ঞান অর্জন করা প্রত্যেক মুসলিমের উপর ফরজ।",

  " উত্তম মানুষ সে-ই, যে মানুষের উপকার করে।",

  " রোজাদারের মুখের গন্ধ আল্লাহর কাছে মেশকের সুগন্ধির চেয়েও প্রিয়।",

  " সাহরী খাও, কারণ সাহরীতে বরকত রয়েছে।",

  " ইফতার তাড়াতাড়ি করা সুন্নত।",

  " সালাত হলো দ্বীনের স্তম্ভ।",

  " জামাতে সালাত আদায় করলে অধিক সওয়াব পাওয়া যায়।",

  " দোয়াই ইবাদতের মূল।",

  " আল্লাহর কাছে সবচেয়ে প্রিয় আমল হলো নিয়মিত আমল, যদিও তা অল্প হয়।",

  " যে ব্যক্তি আল্লাহর উপর ভরসা করে, আল্লাহ তার জন্য যথেষ্ট।",

  " আত্মীয়তার সম্পর্ক বজায় রাখো।",

  " কৃতজ্ঞ ব্যক্তি আল্লাহর কাছেও প্রিয়।",
];

btn.addEventListener('click', function () {
  let qu = quotes[Math.floor(Math.random() * quotes.length)]
  quote.textContent = qu;
})